In [10]:
import pandas as pd 
df = pd.read_csv("type1_data1.csv")

# 1. "subscribed" 컬럼이 2024년 2월인 데이터를 찾으시오 
# 2. 위에서 찾은 데이터 중 "f3" 컬럼이 gold인 데이터의 개수를 구하시오

In [11]:
df

        id   age city    f1  f2      f3    f4         f5  subscribed   views
0     id01   2.0   서울   NaN   0    gold  ENFJ  91.297791  2024-07-16  6820.0
1     id02   9.0   서울  70.0   1     NaN  ENFJ  60.339826  2024-05-12  2534.0
2     id03  27.0   서울  61.0   1    gold  ISTJ  17.252986  2024-03-16  7312.0
3     id04  75.0   서울   NaN   2     NaN  INFP  52.667078  2024-07-21   493.0
4     id05  24.0   서울  85.0   2     NaN  ISFJ  29.269869  2024-03-07  1338.0
..     ...   ...  ...   ...  ..     ...   ...        ...         ...     ...
115  id114  22.0   대구  23.0   0    gold  INTP   0.000000  2025-02-17  9747.0
116  id115  23.0   부산  65.0   0     vip  ENTP   0.000000  2025-02-17  5628.0
117  id116  23.0   서울  12.0   1  silver  INFP   0.000000  2025-02-17  1267.0
118  id117  23.0   대구  65.0   2    gold  INFP   0.000000  2025-02-17  6543.0
119  id118  24.0   부산  94.0   1     vip  ESFJ   0.000000  2025-02-17  2356.0

[120 rows x 10 columns]

In [19]:
# 1. "subscribed" 컬럼이 2024년 2월인 데이터를 찾으시오 
df["subscribed"]=pd.to_datetime(df["subscribed"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          120 non-null    object
 1   age         120 non-null    float64
 2   city        120 non-null    object
 3   f1          89 non-null     float64
 4   f2          120 non-null    int64
 5   f3          91 non-null     object
 6   f4          120 non-null    object
 7   f5          120 non-null    float64
 8   subscribed  120 non-null    datetime64[ns]
 9   views       116 non-null    float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(4)
memory usage: 9.5+ KB

In [22]:
df["year"]=df["subscribed"].dt.year
df.head()

     id   age city    f1  f2    f3    f4         f5 subscribed   views  year
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791 2024-07-16  6820.0  2024
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826 2024-05-12  2534.0  2024
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986 2024-03-16  7312.0  2024
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078 2024-07-21   493.0  2024
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869 2024-03-07  1338.0  2024

In [25]:
df["month"]=df["subscribed"].dt.month
df.head()

,id,age,city,f1,f2,f3,f4,f5,subscribed,views,year,month
0,id01,2.0,서울,NaN,0,gold,ENFJ,91.297791,2024-07-16,6820.0,2024,7
1,id02,9.0,서울,70.0,1,NaN,ENFJ,60.339826,2024-05-12,2534.0,2024,5
2,id03,27.0,서울,61.0,1,gold,ISTJ,17.252986,2024-03-16,7312.0,2024,3
3,id04,75.0,서울,NaN,2,NaN,INFP,52.667078,2024-07-21,493.0,2024,7
4,id05,24.0,서울,85.0,2,NaN,ISFJ,29.269869,2024-03-07,1338.0,2024,3

In [30]:
cond1 = (df["year"] == 2024) & (df["month"] == 2)
df=df[cond1]
df

,id,age,city,f1,f2,f3,f4,f5,subscribed,views,year,month
10,id100,47.0,경기,53.0,0,vip,ESFP,33.308999,2024-02-21,15535.0,2024,2
22,id22,-6.3,부산,72.0,1,gold,ENFP,52.667078,2024-02-09,6147.0,2024,2
31,id31,86.0,부산,77.0,0,gold,ESFJ,73.586397,2024-02-11,8014.0,2024,2
34,id34,65.0,부산,NaN,1,silver,INFP,48.431184,2024-02-01,3163.0,2024,2
42,id42,65.0,대구,48.0,2,gold,ESTP,33.308999,2024-02-09,5999.0,2024,2
55,id55,75.0,대구,63.0,2,gold,ENTP,13.049921,2024-02-06,6042.0,2024,2
61,id61,87.0,경기,62.0,2,NaN,INTP,69.730313,2024-02-03,218.0,2024,2
64,id64,43.0,경기,62.0,2,gold,ESFP,73.586397,2024-02-22,5995.0,2024,2
86,id86,2.0,경기,NaN,0,NaN,ESTP,29.269869,2024-02-16,2155.0,2024,2
100,id100,47.0,경기,53.0,0,vip,ESFP,33.308999,2024-02-21,15535.0,2024,2

In [32]:
# 2. 위에서 찾은 데이터 중 "f3" 컬럼이 gold인 데이터의 개수를 구하시오 
cond2 = df["f3"] == "gold"
sum(cond2)

5